
my_list99 = [1,2,657,5,7,0,2,3,4,5,0,-77,88,0,99,11,0,8,6]
print(my_list99)

count_zeros = my_list99.count(0)               # рахуємо кількість нулів
print("Кількість елементів НУЛЬ в списку:", count_zeros)
while 0 in my_list99:          # поки є хоча б один 0
    my_list99.remove(0)        # видаляємо перший знайдений 0

print("Проміжний результат після видалення НУЛІВ:", my_list99)
my_list99.extend([0] * count_zeros)            # додаємо всі нулі в кінець
print("Кінцевий результат перестановки НУЛІВ в списку:", my_list99)